In [1]:
%load_ext sql

In [2]:
%sql postgresql://johnrick:johnrick@127.0.0.1/sparkifydb

In [3]:
%sql SELECT * FROM songplay LIMIT 5;

 * postgresql://johnrick:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.time(2, 33, 56, 796000), 69, 'free', None, None, 455, 'Philadelphia-Camden-Wilmington, PA-NJ-DE-MD', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (2, datetime.time(2, 36, 10, 796000), 69, 'free', None, None, 455, 'Philadelphia-Camden-Wilmington, PA-NJ-DE-MD', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (3, datetime.time(2, 40, 34, 796000), 69, 'free', None, None, 455, 'Philadelphia-Camden-Wilmington, PA-NJ-DE-MD', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (4, datetime.time(4, 36, 13, 796000), 32, 'free', None, None, 456, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (5, datetime.time(4, 36, 46, 796000), 75, 'free', None, None, 284, 'Columbia, SC', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_3) AppleWebKit/537.75.14 (KHTML, like Gecko) Version/7.0.3 Safari/537.75.14"')]

In [4]:
%sql SELECT * FROM songplay WHERE artist_id IS NOT NULL LIMIT 5;

 * postgresql://johnrick:***@127.0.0.1/sparkifydb
1 rows affected.

[(5537, datetime.time(21, 56, 47, 796000), 15, 'paid', 'AR5KOSW1187FB35FF4', 'SOZCTXZ12AB0182364', 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [5]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://johnrick:***@127.0.0.1/sparkifydb
5 rows affected.

[('47', 'Kimber', 'Norris', 'F', 'free'),
 ('56', 'Cienna', 'Freeman', 'F', 'free'),
 ('68', 'Jordan', 'Rodriguez', 'F', 'free'),
 ('62', 'Connar', 'Moreno', 'M', 'free'),
 ('39', 'Walter', 'Frye', 'M', 'free')]

In [6]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://johnrick:***@127.0.0.1/sparkifydb
5 rows affected.

[('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, Decimal('233.40363')),
 ('SOIAZJW12AB01853F1', 'Pink World', 'AR8ZCNI1187B9A069B', 1984, Decimal('269.81832')),
 ('SOFSOCN12A8C143F5D', 'Face the Ashes', 'ARXR32B1187FB57099', 2007, Decimal('209.60608')),
 ('SOHKNRJ12A6701D1F8', 'Drop of Rain', 'AR10USD1187B99F3F1', 0, Decimal('189.57016')),
 ('SOQHXMF12AB0182363', 'Young Boy Blues', 'ARGSJW91187B9B1D6B', 0, Decimal('218.77506'))]

In [7]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://johnrick:***@127.0.0.1/sparkifydb
5 rows affected.

[('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', Decimal('NaN'), Decimal('NaN')),
 ('AR8ZCNI1187B9A069B', 'Planet P Project', '', Decimal('NaN'), Decimal('NaN')),
 ('ARXR32B1187FB57099', 'Gob', '', Decimal('NaN'), Decimal('NaN')),
 ('AR10USD1187B99F3F1', 'Tweeterfriendly Music', 'Burlington, Ontario, Canada', Decimal('NaN'), Decimal('NaN')),
 ('ARGSJW91187B9B1D6B', 'JennyAnyKind', 'North Carolina', Decimal('35.21962'), Decimal('-80.01955'))]

In [8]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://johnrick:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.time(2, 33, 56, 796000), 2, 11, 45, 11, 2018, 6),
 (datetime.time(2, 36, 10, 796000), 2, 11, 45, 11, 2018, 6),
 (datetime.time(2, 40, 34, 796000), 2, 11, 45, 11, 2018, 6),
 (datetime.time(4, 36, 13, 796000), 4, 11, 45, 11, 2018, 6),
 (datetime.time(4, 36, 46, 796000), 4, 11, 45, 11, 2018, 6)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).